2020.05.31
今天重返校园，你在深圳和洛阳分别待了两个小时，我想你有一些东西需要总结。
这里记录一下。
最主要的是关于家里的，家庭关系确实因为姐姐的孩子有所影响，但我想大家总有办法去化解，不应该因此生气，发火，抱怨。姐姐已经做的很好了，所以你那天发给姐姐的两段话确实语气有些重。她本身承受了很多，所以不应该这样。虽然你说的都对，但你应该用一种更温和的方式去表达。在这方面你已经吃过不止一次亏了，还不吸取教训。即使是最亲近的人也不能赤裸裸直白的去表达，希望以后能够改进。
另一方面，是做事方面，比如说取火车票，明明人家已经电子化，你还要去取纸质票，为什么不提前查查如何认证资质。搞清楚对方的需求你才能更好的完成任务。不至于南辕北辙，事倍功半。另一个是老板让你填信息，你不认真看，虽然转眼就忘确实是因为神经衰弱，但抓住重点而不只是完成任务迅速交差要更为关键。抓重放小，知道别人让你干什么而不是傻乎乎的一股脑往上冲。
这一点在编程的时候也比较重要，虽然时间紧会影响一定的思考，但还是要遵循一定的逻辑。先把需求写好，需要哪些函数去完成功能，把这个表单先完成。完成一个函数测试一下，排除自身bug的可能。接着是部分重要的功能完成之后，搭建整体的框架，先把整体跑通，再去考虑细枝末节。当然有一个好的编程习惯，在一开始就把细节做好是非常好的。
gurobi 调试bug的时候，无非就是 obj, constraints, variable types(B,C,I), sense, 可以通过写出模型判断模型是否正确。一开始写的时候，就把模型用注释写在开头，以免只看程序的可读性不够。

最后是关于这四个月虽然浪费了大多数时间，但想要完成你的目标还是很有机会。一定要有信心，去追寻你想要的，现在也没有退路了，就是英语练好，完成老板的任务，好好总结知识逻辑框架，不要浪费时间在无聊的视频上了，真的是时间黑洞，一看就停不下来。晚上也不要花时间在手机上，不想睡的话听听听力就可以结束了，听不懂听累了就睡，也不要去看手机省的又刺激神经。

这也算是接下来几个月的工作计划表，虽然 meeting 时间会缩短，但还是能够抽出时间去练习英语。隔天去跑步的话，就在操场练习口语，这很重要，一定要坚持。如果实验室和寝室没有环境让你 speak out,在内心构思好计时说出来。然后听力晚上早上都可以进行。阅读不用经常练习，一周一次加强记忆，保持热度。最后是写作每周一次独立和综合。听力是重中之重,切记。

对于文章进度，可以通过读文献弥补阅读的不足。完成任务就可以睡觉了，不用想太多，但要有时间概念。就这样加油吧。
